app/controllers/content_controller.rb

  def home
     cache_control({:ttl => 900})
     if params[:id].nil?
       @post = Post.find(rand(Post.count)+1)
---
SELECT * FROM "posts" WHERE ("posts"."id" = 1)