app/controllers/posts_controller.rb

SELECT * FROM "posts" WHERE ("posts"."id" = 1)
---
  def show
    #setting cookie will not work with Varnish caching it!!!
    @post = Post.find(params[:id])

INSERT INTO "posts" ("updated_at", "title", "body", "published", "created_at") VALUES('2009-10-08 23:20:27', 'Eating pancakes actually burns calories!', '<img src="/images/bunny_pancake.jpg">Lorem ipsum dolor sit amet, consectetur adipisicing elit, sed do eiusmod tempor incididunt ut labore et dolore magna aliqua. Ut enim ad minim veniam, quis nostrud exercitation ullamco laboris nisi ut aliquip ex ea commodo consequat. Duis aute irure dolor in reprehenderit in voluptate velit esse cillum dolore eu fugiat nulla pariatur. Excepteur sint occaecat cupidatat non proident, sunt in culpa qui officia deserunt mollit anim id est laborum.
---
  def create
    @post = Post.new(params[:post])

    respond_to do |format|
      if @post.save

SELECT * FROM "posts" WHERE ("posts"."id" = 1)
UPDATE "posts" SET "body" = 'Lorem ipsum dolor sit amet, consectetur adipisicing elit, sed do eiusmod tempor incididunt ut labore et dolore magna aliqua.
---
  def update
    @post = Post.find(params[:id])

    respond_to do |format|
      if @post.update_attributes(params[:post])